app/views/users/likes.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 8]]
---
      <!-- Define the post variable -->
      <% post=Post.find_by(id:like.post_id) %>