app/controllers/likes_controller.rb

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 8], ["post_id", 6], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 2]]
---
    def destroy
    @like=Like.find_by(user_id:@current_user.id,post_id:params[:post_id])
    if @like
    @like.destroy