app/controllers/posts_controller.rb

  def show
    @post = Post.find_by(id:params[:id])
    @user= User.find_by(id:@post.user_id)
    @likes_count=Like.where(post_id:params[:id]).count
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 8]]

  def create
    @post=Post.new(content:params[:contents],
    user_id:@current_user.id
    )
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "a\r\n"], ["created_at", "2020-05-13 16:23:35.765562"], ["updated_at", "2020-05-13 16:23:35.765562"], ["user_id", 7]]