app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name") VALUES (?, ?, ?, ?, ?)  [["name", "e"], ["email", "b"], ["created_at", "2020-05-08 08:17:39.055735"], ["updated_at", "2020-05-08 08:17:39.055735"], ["image_name", "tweets_about2.png"]]
---
  def create
    @user=User.new(name: params[:name],
    email: params[:email],
    image_name:"default_image.jpg",
    password:params[:password]
    )

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "users" SET "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_name", ""], ["updated_at", "2020-05-08 16:12:34.927022"], ["id", 2]]
---
  def update
    @user=User.find_by(id: params[:id])
    @user.name=params[:name]
    @user.email=params[:email]
    if params[:image]
      @user.image_name="#{@user.id}.jpg"
      image=params[:image]
      File.binwrite("public/user_images/#{@user.image_name}",image.read)
    end
    if @user.save